# แบบฝึกหัด 3

---

In [1]:
import numpy as np
import pandas as pd
import statistics

###

3.1 บริษัทให้บริการด้าน IT ครบวงจรแห่งหนึ่งได้เก็บรวบรวมข้อมูลค่าซ่อมบำรุงอุปกรณ์คอมพิวเตอร์แม่ข่ายและจำนวนลูกค้าของบริษัทในปีที่ผ่านมาเป็นดังไฟล์ asm3_1_itcost.csv  
จงแสดงวิธีหาค่ามัธยฐานและฐานนิยมของค่าซ่อมบำรุงอุปกรณ์คอมพิวเตอร์แม่ข่าย

In [2]:
df_it = pd.read_csv('007.csv')
df_it.head()

  maintenance_cost  num_customer
0           <=5000            33
1       5001-10000            41
2      10001-15000            20
3      15001-20000            17
4      20001-25000            10

In [3]:
# หามัธยฐาน
df_it['total_num'] = df_it['num_customer'].cumsum()
display(df_it)
med = df_it['num_customer'].sum()/2
print(med)
mi = (5001 + 5000) / 2
print(mi)
summi = mi + ((med - df_it.total_num[0])/df_it.num_customer[1])*7
print(summi)

#หาฐานนิยม
h = df_it['num_customer'].idxmax()
de_m = np.abs(df_it.num_customer[h] - df_it.num_customer[h-1])
de_m1 = np.abs(df_it.num_customer[h] - df_it.num_customer[h+1])
summp = mi + (de_m/(de_m+de_m1))*7
print(summp)

  maintenance_cost  num_customer  total_num
0           <=5000            33         33
1       5001-10000            41         74
2      10001-15000            20         94
3      15001-20000            17        111
4      20001-25000            10        121
5      25001-30000            16        137
6          >=30001             5        142

71.0
5000.5
5006.987804878048
5002.431034482759

###

3.2 สุ่มตัวอย่างนักศึกษามาจำนวนหนึ่ง พบว่าคะแนนสอบวิชาสถิติ เป็นดังตาราง 'asm3_2_score.csv' จงหาค่า

**3.2.1 ค่าเฉลี่ย**

In [27]:
df_score = pd.read_csv('https://raw.githubusercontent.com/ThammakornS/ProgStat/main/dataset/asm3_2_score.csv')
df_score.head()

   score  num_student
0  11-15           15
1  16-20           14
2  21-25           20
3  26-30           18
4  31-35           16

In [29]:
df_score[['mi','mx']] = df_score['score'].str.split('-',expand=True).astype(int)
df_score['mid'] = (df_score.mx + df_score.mi) / 2
df_score['fx'] = df_score['num_student'] * df_score['mid']
b = df_score['fx'].sum() / df_score['num_student'].sum()
print(b)
display(df_score)

25.85

   score  num_student  mi  mx   mid     fx
0  11-15           15  11  15  13.0  195.0
1  16-20           14  16  20  18.0  252.0
2  21-25           20  21  25  23.0  460.0
3  26-30           18  26  30  28.0  504.0
4  31-35           16  31  35  33.0  528.0
5  36-40           17  36  40  38.0  646.0

**3.2.2 ค่ามัธยฐาน**

In [17]:
df_score['total_num'] = df_score['num_student'].cumsum()
display(df_score)
med = df_score['num_student'].sum() / 2
print(med)
mii = (25 + 26) / 2
print(mii)
summ = mii + ((med - df_score.total_num[2])/ df_score.num_student[3])*6
print(summ)

   score  num_student  mi  mx   mid     fx  total_num
0  11-15           15  11  15  13.0  195.0         15
1  16-20           14  16  20  18.0  252.0         29
2  21-25           20  21  25  23.0  460.0         49
3  26-30           18  26  30  28.0  504.0         67
4  31-35           16  31  35  33.0  528.0         83
5  36-40           17  36  40  38.0  646.0        100

50.0
25.5
25.833333333333332

**3.2.3 ค่าฐานนิยม**

In [18]:
tp = df_score['num_student'].idxmax()
de = df_score.num_student[tp] - df_score.num_student[tp-1]
de1 = df_score.num_student[tp] - df_score.num_student[tp+1]
mi = (df_score.mi[tp] - df_score.mx[tp-1]) / 2;
sumi = mi + (de / (de + de1))*6 
print(sumi)

5.0

**3.2.4 Q<sub>1</sub> และ Q<sub>3</sub>**

In [19]:
#q1
n = 100
q1_1 = n*1/4
display(df_score)
print(q1_1)
e = 4
l = (df_score.mx[e-1] + df_score.mi[e]) / 2
q1 = l + ((q1_1 - df_score.total_num[e-1])/df_score.num_student[e])*5
print('q1 =',q1)


#q3
n = 100
q3_1 = n*3/4
print(q3_1)
e = 4
l = (df_score.mx[e-1] + df_score.mi[e]) / 2
q3 = l + ((q3_1 - df_score.total_num[e-1])/df_score.num_student[e])*5
print('q3 =',q3)

   score  num_student  mi  mx   mid  total_num
0  11-15           15  11  15  13.0         15
1  16-20           14  16  20  18.0         29
2  21-25           20  21  25  23.0         49
3  26-30           18  26  30  28.0         67
4  31-35           16  31  35  33.0         83
5  36-40           17  36  40  38.0        100

25.0
q1 = 17.375
75.0
q3 = 33.0

**3.2.5 D<sub>7</sub>**

In [20]:
display(df_score)
n = 100
d1_1 = n*7/10
print(d1_1)
e = 4
l = (df_score.mx[e-1] + df_score.mi[e]) /2

d7 = l + ((d1_1 - df_score.total_num[e-1])/df_score.num_student[e])*5
print('d7 =',d7)

   score  num_student  mi  mx   mid  total_num
0  11-15           15  11  15  13.0         15
1  16-20           14  16  20  18.0         29
2  21-25           20  21  25  23.0         49
3  26-30           18  26  30  28.0         67
4  31-35           16  31  35  33.0         83
5  36-40           17  36  40  38.0        100

70.0
d7 = 31.4375

**3.2.6 P<sub>75</sub>**

In [21]:
display(df_score)
n = 100
p1_1 = n*75/100
print(p1_1)
e = 4
l = (df_score.mi[e] + df_score.mx[e-1])/2

p75 = l + ((p1_1 - df_score.total_num[e-1])/df_score.num_student[e])*5
print('p75 = ',p75)

   score  num_student  mi  mx   mid  total_num
0  11-15           15  11  15  13.0         15
1  16-20           14  16  20  18.0         29
2  21-25           20  21  25  23.0         49
3  26-30           18  26  30  28.0         67
4  31-35           16  31  35  33.0         83
5  36-40           17  36  40  38.0        100

75.0
p75 =  33.0

**3.2.7 พิสัย**

In [22]:
display(df_score)
p =  df_score['mx'].iloc[-1] - df_score['mi'].iloc[0]
print('พิสัย =',p)

   score  num_student  mi  mx   mid  total_num
0  11-15           15  11  15  13.0         15
1  16-20           14  16  20  18.0         29
2  21-25           20  21  25  23.0         49
3  26-30           18  26  30  28.0         67
4  31-35           16  31  35  33.0         83
5  36-40           17  36  40  38.0        100

พิสัย = 29

**3.2.8 ส่วนเบี่ยงเบนควอร์ไทล์**

In [23]:
qd = (q3 - q1) / 2
print('Q.D =',qd)

Q.D = 7.8125

**3.2.9 ส่วนเบี่ยงเบนมาตราฐานและความแปรปรวน**

In [24]:
# เบี่ยงเบนมาตราฐาน 
display(df_score)
x = sum((df_score['mi']+df_score['mx'])/2 * df_score['num_student']/ df_score['num_student'].sum())
n = df_score['num_student'].sum()
print(n)
fx2 = sum(((df_score['mi']+df_score['mx']) /2) ** 2 * df_score['num_student'])
s = np.sqrt((fx2 - n*x**2) / (n-1))
print("เบี่ยงเบนมาตราฐาน =",s)
#ความแปรปรวน
s2 = s**2
print("แปรปรวน = ",s2)

   score  num_student  mi  mx   mid  total_num
0  11-15           15  11  15  13.0         15
1  16-20           14  16  20  18.0         29
2  21-25           20  21  25  23.0         49
3  26-30           18  26  30  28.0         67
4  31-35           16  31  35  33.0         83
5  36-40           17  36  40  38.0        100

100
เบี่ยงเบนมาตราฐาน = 8.356180800805918
แปรปรวน =  69.82575757575744

**3.2.10 สัมประสิทธิ์ของการแปรผัน**

In [25]:
cv = (s / x ) * 100
print(cv)

32.32565106694746

###

3.3 บริษัทเกมแห่งหนึ่งได้ทำการทดสอบ game engine รุ่นใหม่ ในคอมพิวเตอร์ที่มีส่วนประกอบของฮารด์แวร์ต่างๆกัน (เช่น cpu, gpu, ram, ฯลฯ) จำนวน 30 เครื่อง และทำการวัดค่า frames per second (FPS) ได้ผลดังนี้  
60.0, 30.2, 33.4, 59.9, 40.1, 25.5, 17.4, 28.6, 45.5, 57.8,  
22.5, 50.2, 30.8, 43.1, 50.5, 35.5, 27.4, 29.2, 55.5, 10.2,   
32.2, 27.8, 33.8, 53.4, 25.5, 30.4, 36.1, 49.3, 18.6, 50.0   
จงคำนวณหาค่าเฉลี่ย, ส่วนเบี่ยงเบนมาตราฐาน, ฐานนิยม, Q<sub>1</sub>, D<sub>3</sub>, P<sub>45</sub> ของค่า FPS ที่ได้จากการทดสอบ

ค่าเฉลี่ย:

In [26]:
fps = [60.0, 30.2, 33.4, 59.9, 40.1, 25.5, 17.4, 28.6, 45.5, 57.8,
       22.5, 50.2, 30.8, 43.1, 50.5, 35.5, 27.4, 29.2, 55.5, 10.2,
       32.2, 27.8, 33.8, 53.4, 25.5, 30.4, 36.1, 49.3, 18.6, 50.0]

In [36]:
may = np.mean(fps)
print(may)

37.01333333333333

ส่วนเบี่ยงเบนมาตราฐาน:

In [39]:
std = np.std(fps, ddof=1)
print(std)

13.51187812906528

ฐานนิยม:

In [41]:
mo = statistics.mode(fps)
print(mo)

25.5

Q<sub>1</sub>, D<sub>3</sub> และ P<sub>45</sub>:

In [37]:
q1_2 = np.percentile(fps, 25)
print("q1 = ",q1_2)
d3_2 = np.percentile(fps, 30)
print("d3 = ",d3_2)
p45_2 = np.percentile(fps, 45)
print("p45 = ",p45_2)

q1 =  28.0
d3 =  29.02
p45 =  32.260000000000005

###

3.4 หน่วยงานวิจัยแห่งหนึ่งได้รับมอบหมายจากทางรัฐบาลให้ทำการเปรียบเทียบระบบที่ใช้ในการผลิตพลังงานกระแสไฟฟ้าสำหรับนิคมอุตสาหกรรมแห่งหนึ่ง ระบบแรกมีกำลังการผลิตสูงสุด 10,000 เมกะวัตต์ โดยมีค่าเฉลี่ยและส่วนเบี่ยงเบนมาตราฐานของกำลังการผลิตอยู่ที่ 9,000±320 เมกะวัตต์ ระบบที่สองมีกำลังการผลิตสูงสุด 15,000 เมกะวัตต์ โดยมีค่าเฉลี่ยและส่วนเบี่ยงเบนมาตราฐานของกำลังการผลิตอยู่ที่ 14,000±900 เมกะวัตต์ จากข้อมูลนี้ทางสถาบันวิจัยจะสามารถสรุปว่าระบบใดมีกำลังการผลิตที่เที่ยงตรงกว่า

In [44]:
cv1 = (320/9000) * 100
print(cv1)
cv2 = (900/14000) * 100
print(cv2)
print("ระบบที่ 1 เที่ยงตรงกว่า")

3.5555555555555554
6.428571428571428
ระบบที่ 1 เที่ยงตรงกว่า